/*
Author: Gudakov Ramil Sergeevich a.k.a. Gauss 
Гудаков Рамиль Сергеевич 
Contacts: [ramil2085@mail.ru, ramil2085@gmail.com]
See for more information License.h.
*/

#include "ParamBuilderConstraint.h"

using namespace nsParamBuilderConstraint;

//-------------------------------------------------------------------------------------------
TGeneric6Dof::TGeneric6Dof():TBaseParam(Generic6Dof)
{

}
//-------------------------------------------------------------------------------------------
TGeneric6DofSpring::TGeneric6DofSpring():TBaseParam(Generic6DofSpring)
{

}
//-------------------------------------------------------------------------------------------
TFixed::TFixed():TBaseParam(Fixed)
{

}
//-------------------------------------------------------------------------------------------
TSlider::TSlider():TBaseParam(Slider)
{

}
//-------------------------------------------------------------------------------------------
TConeTwist::TConeTwist():TBaseParam(ConeTwist)
{

}
//-------------------------------------------------------------------------------------------
THinge::THinge():TBaseParam(Hinge)
{

}
//-------------------------------------------------------------------------------------------
THinge2::THinge2():TBaseParam(Hinge2)
{

}
//-------------------------------------------------------------------------------------------
TPoint2Point::TPoint2Point():TBaseParam(Point2Point)
{

}
//-------------------------------------------------------------------------------------------
TGear::TGear():TBaseParam(Gear)
{

}
//-------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------
